/*Даны произвольные числа x1, x2, x3, y1, y2, y3. 
Принадлежит ли начало координат треугольнику с вершинами (x1 ,y1 ), (x2 ,y2), (x3 ,y3)? */

#include <stdio.h>
#include <locale.h>
#include <math.h>
#include <stdlib.h>

int main()
{
	setlocale(LC_CTYPE, "Russian");
	float x1, x2, x3, y1, y2, y3; //переменные для чисел
	printf("Введите координаты:\n");
	printf(" x1 ="); //x1
	scanf_s("%f", &x1);
	printf(" y1 ="); //y1
	scanf_s("%f", &y1);
	printf(" x2 ="); //x2
	scanf_s("%f", &x2);
	printf(" y2 ="); //y2
	scanf_s("%f", &y2);
	printf(" x3 ="); //x3
	scanf_s("%f", &x3);
	printf(" y3 ="); //y3
	scanf_s("%f", &y3);
	if ((x1 == x2) && (y1 == y2) || (x1 == x3) && (y1 == y3) || (x2 == x3) && (y2 == y3))
	{
		printf("Невозможно построить треугольник, т. к. некоторые точки совпада-ют\n");
		return 1;
	}
	if ((x3 - x1) / (x2 - x1) == (y3 - y1) / (y2 - y1))
	{
		printf("Невозможно построить треугольник, т. к. точки лежат на одной пря-мой\n");
		return 1;
	}
	if ((x1 <= 0 && x2 >= 0) || (x1 >= 0 && x2 <= 0) || (x3 <= 0 && x2 >= 0) || (x3 >= 0 && x2 <= 0) || (x3 <= 0 && x1 >= 0) || (x3 >= 0 && x1 <= 0))
	{
		if ((y1 <= 0 && y2 >= 0) || (y1 >= 0 && y2 <= 0) || (y3 <= 0 && y2 >= 0) || (y3 >= 0 && y2 <= 0) || (y3 <= 0 && y1 >= 0) || (y3 >= 0 && y1 <= 0))
		{
			printf("Точка (0; 0) принадлежит треугольнику\n");
		}
		else  printf("Точка (0; 0) НЕ принадлежит треугольнику\n");
	}
	else printf("Точка (0; 0) НЕ принадлежит треугольнику\n");
	return 0;
}
